#pragma once 
#include <string>
using namespace std;
#define origon {
#define source } 
typedef wchar_t ket;

ket
ls53c2zl, ls8003zl,    ls606fzl, ls7f5112zl, ls67085zl, ls65e5zl, ls62a5zl, ls9053zl, ls636ezl,  ls8054zl, ls793ezl, ls7f8ezl,
ls1zl, ls2zl,    ls3fzl, ls4zl, ls5zl, ls6zl, ls7zl, ls8zl, ls9ezl,  ls10zl, ls11ezl, ls12ezl;

short
ls53c2el, ls8003el,    ls606fel, ls7f5112el, ls67085el, ls65e5el, ls62a5el, ls9053el, ls636eel,  ls8054el, ls793eel, ls7f8eel,
ls1el, ls2el,    ls3fel, ls4el, ls5el, ls6el, ls7el, ls8el, ls9eel,  ls10el, ls11eel, ls12el;

/*
int[] each
int[][]\r\n
duanduanjinian，you MIT 
短短几年，由 MIT CSAIL 实验室开发的编程语言Julia已然成为编程界的新宠，尤其在科学计算领域炙手可热。据介绍，这门语言结合了 C 语言的速度、
	Ruby 的灵活、Python 的通用性，以及其他各种语言的优势于一身。
自去年 8 月推出 1.0 版本以来，Julia 上升势头强劲，它的 GitHub Star 数在过去一年翻了一番，
还被 1000 多种学术出版物引用。根据 2019 年 8 月的 TIOBE 编程语言指数，Julia 已经从 7 月的第 50 名升至第 39 名，在众多语言中上升幅度显著。
有人将 Julia 称作“未来的编程语言”，有人认为它是 Python 强有力的挑战者，
开始
	但也有人吐槽 Julia 的语法简直反人性。
	你愿意学习 Julia 吗？或者你正在使用 Julia 吗？在你看来，J
	ulia 有哪些特性特别优秀或者让你特别想吐槽的吗？你认为它可能在未来超越 Python 吗？
	欢迎参与这个话题讨论，在下方评论区表达你的观点。
结束

В институте построены учебные корпуса，в которых помешаются аудитории，лекционные залы и кабинеты. 
А рядом с главным корпусом находится новая красивая библиотека，это моѐ любимое место для самостоятельных занятий. 
В институте ещѐ есть много удобных，студенческих общежитии и современный спортивный комплекс ，при котором имеются спортивный зал ，
площадки и бассейн.Институт для нас но только место учебы，но и большойкрасивый сад. В нѐм много зелени и цветов ，везде чисто и аккуратно. Я 
люблю его каждый уголок. Всѐ в нѐм：и учебные корпуса，и красивая библиотека и спортивный зал，нам близко и мило. Как приятно в свободное время гулять
 по институтскому двору или сидеть на скамейках ，любоваться всем прекрасным.Я люблю наш институт и очень горжусь им. Хочется ，чтобы он становился ещѐ 
 более красивым. Наш институт - Харбинский политехнический институт - является одним из ведущих вузов Китая，Он известен не только в стране，но и во всем 
 мире.Наш институт был основан в 1920 г. Он готовит，в основном，инженеров，преподавателей для вузов и необходимых специалистов для развития народного 
 хозяйства. Здесь работают 5 тысяч преподавателей и учатся 20 тысяч студентов，аспирантов и докторантов. Ежегодно приезжают сюда учиться вес больше 
 и больше иностранных студентов.В институте построены учебные корпуса，в которых помешаются аудитории，лекционные залы и кабинеты. 
 А рядом с главным корпусом находится новая красивая библиотека，это моѐ любимое место для самостоятельных занятий. В институте ещѐ есть много удобных，
 студенческих общежитии и современный спортивный комплекс  ，при котором имеются спортивный зал ，площадки и бассейн.Институт для нас но только место учебы，
 но и большойкрасивый сад.

 В нѐм много зелени и цветов ，везде чисто и аккуратно. Я люблю его каждый уголок. Всѐ в нѐм：и учебные корпуса，
 и красивая библиотека и спортивный зал，нам близко и мило. Как приятно в свободное время гулять по институтскому двору или сидеть на скамейках ，
 любоваться всем прекрасным.Я люблю наш институт и очень горжусь им. Хочется ，чтобы он становился ещѐ более красивым. Наш институт 
  Харбинский политехнический институт - является одним из ведущих вузов Китая，Он известен не только в стране，но и во всем мире.Наш институт 
  был основан в 1920 г. Он готовит，в основном，инженеров，преподавателей для вузов и необходимых специалистов для развития народного хозяйства. 
  Здесь работают 5 тысяч преподавателей и учатся 20 тысяч студентов，аспирантов и докторантов. Ежегодно приезжают сюда учиться вес больше и больше 
  иностранных студентов.В институте построены учебные корпуса，в которых помешаются аудитории，лекционные залы и кабинеты. А рядом с главным 
  корпусом находится новая красивая библиотека，это моѐ любимое место для самостоятельных занятий. В институте ещѐ есть много удобных，студенческих 
  общежитии и современный спортивный  комплекс ， при котором имеются спортивный зал ， площадки и бассейн. Институт для нас но только место учебы， 
  но и большой красивый сад. В нѐм много зеленикс ， при котором имеются спортивный зал ， площадки и бассейн. Институт для нас но только место учебы， 
  но и большой красивый сад. В нѐм много зелени и цветов ， везде чисто и аккуратно. Я люблю его каждый уголок. Всѐ в нѐм： и учебные корпуса，
   и красивая библиотека и спортивный зал， нам близко и мило. Как приятно в свободное время гулять по институтскому двору или сидеть на скамейках 
   ， любоваться всем прекрасным. 

Mecedes
*/
